module.exports = Object.freeze({
  roles: {
    CHARGE: 1,
    UP: 2,
    BUILD: 3,
  },
  NormalCharaStates: {
    GAIN_SRC: 1,
    WORK_SPAWN: 2,
    WORK_BUILD: 3,
    WORK_UP: 4,
    WORK_TOWER: 5,
  },
  creepNames: [
    '心愛', '智乃', '理世', '千夜', '紗路', 'ティッピー', 'モカ', 'ワイルドギース', '麻耶', '恵',
    '忍', 'アリス', '綾', '陽子', 'カレン', '穂乃花',
    'ゆずこ', '縁', '唯', '千穂', '佳', 'ふみ',
    'あかり', '京子', '結衣', 'ちなつ', '綾乃', '千歳', '櫻子', '向日葵', 'りせ', 'あかね', 'まり', 'ともこ', '撫子', '花子', '楓',
  ],
  charaColors: {
    心愛: '#f96', 智乃: '#ccf', 理世: '#90f', 千夜: '#173', 紗路: '#fc3',
    ティッピー: '#ffe', モカ: '#f87', ワイルドギース: '#93f', 麻耶: '#43c', 恵: '#f34',
    忍: '#371', アリス: '#fcf8bb', 綾: '#309', 陽子: '#d30', カレン: '#fefabc',
    穂乃花: '#775459',
    ゆずこ: '#f99', 縁: '#63c', 唯: '#ee3',
    千穂: '#600', 佳: '#600', ふみ: '#600',
    あかり: '#f34', 京子: '#cc0', 結衣: '#310', ちなつ: '#faa',
    綾乃: '#a76b85', 千歳: '#e0dbe1', 櫻子: '#d0baa2', 向日葵: '#32a',
    りせ: 'black', あかね: '#f34', まり: '#310', ともこ: '#faa',
    撫子: '#d8b2a3', 花子: '#8d6b62', 楓: '#788698',
  },
});
