module.exports = {
  roles: {
    CHARGE: 1,
    UP: 2,
    BUILD: 3,
  },

  creepNames: [
    '心愛', '智乃', '理世', '千夜', '紗路', 'ティッピー', 'モカ', 'ワイルドギース', '麻耶', '恵',
    '忍', 'アリス', '綾', '陽子', 'カレン', '穂乃花',
    'ゆずこ', '縁', '唯', '千穂', '佳', 'ふみ',
    'あかり', '京子', '結衣', 'ちなつ', '綾乃', '千歳', '櫻子', '向日葵', 'りせ', 'あかね', 'まり', 'ともこ', '撫子', '花子', '楓',
  ],
  charaColors: {
    心愛: '#f96', 智乃: '#ccf', 理世: '#90f', 千夜: '#173', 紗路: '#f63',
    ティッピー: '#ffe', モカ: '#f87', ワイルドギース: '#9ff', 麻耶: '#43c', 恵: '#f34',
    忍: '#371', アリス: '#fcf8bb', 綾: '#309', 陽子: '#d30', カレン: '#fefabc',
    穂乃花: '#775459',
    ゆずこ: '#f99', 縁: '#7868a7', 唯: '#d0ca93',
    千穂: '#d8b2a3', 佳: '#8d6b62', ふみ: '#544542',
    あかり: '#f34', 京子: '#e1cdb1', 結衣: '#73645d', ちなつ: '#faa',
    綾乃: '#a76b85', 千歳: '#e0dbe1', 櫻子: '#d0baa2', 向日葵: '#788698',
    りせ: 'black', あかね: '#f34', まり: '#73645d', ともこ: '#faa',
    撫子: '#d8b2a3', 花子: '#8d6b62', 楓: '#788698',
  },
};
